/* 
Создайте две переменные с именами «первое число» и «второе число» на английском языке, используя lowerCamelCase. Запишите в первую переменную число 11, во вторую — -100. Выведите на экран произведение чисел, записанных в получившихся переменных.

Код будет работать с любыми названиями, а наша система всегда проверяет только результат на экране, поэтому выполнение этого задания — под вашу ответственность.
*/

/* eslint prefer-const: 0 */

// BEGIN
let firstNumber = 11;
let secondNumber = -100;

console.log(firstNumber * secondNumber);
// END