/* 
Теперь ваша очередь посмотреть на сигнатуру функции в документации и разобраться, как её использовать. Можете читать документацию на русском языке, но программист должен уметь читать документацию на английском. Используйте словари или переводчики при необходимости. Лучше сразу привыкать и подтягивать навыки чтения на английском, иначе будут сложности в будущем.

В Math есть функция ceil(). Изучите её документацию.

Напишите программу, которая использует функцию Math.ceil() с константой number и выводит результат на экран.
*/

const number = 923.2238;

// BEGIN (write your solution here)
console.log(Math.ceil(number));
// END
